Lzw655/esp-bsp/examples/p4/base_demo_anti_tearing/esp32_p4_function_ev_board/src/mipi_soc/include/mipi_csi_host_struct.h
            uint32_t reserved24                    :    1;
            uint32_t reserved25                    :    1;
            uint32_t reserved26                    :    1;
            uint32_t reserved27                    :    1;
            uint32_t reserved28                    :    1;
            uint32_t reserved29                    :    1;
            uint32_t reserved30                    :    1;
            uint32_t reserved31                    :    1;
        };
        uint32_t val;
    } int_msk_seq_frame_fatal;
    union {
        struct {
            uint32_t err_f_seq_vc0       :    1;
            uint32_t err_f_seq_vc1       :    1;
            uint32_t err_f_seq_vc2       :    1;
            uint32_t err_f_seq_vc3       :    1;
            uint32_t err_f_seq_vc4       :    1;
            uint32_t err_f_seq_vc5       :    1;
            uint32_t err_f_seq_vc6       :    1;
            uint32_t err_f_seq_vc7       :    1;
            uint32_t err_f_seq_vc8       :    1;
            uint32_t err_f_seq_vc9       :    1;
            uint32_t err_f_seq_vc10      :    1;
            uint32_t err_f_seq_vc11      :    1;
            uint32_t err_f_seq_vc12      :    1;
            uint32_t err_f_seq_vc13      :    1;
            uint32_t err_f_seq_vc14      :    1;
            uint32_t err_f_seq_vc15      :    1;
            uint32_t reserved16                    :    1;
            uint32_t reserved17                    :    1;
            uint32_t reserved18                    :    1;
            uint32_t reserved19                    :    1;
            uint32_t reserved20                    :    1;
            uint32_t reserved21                    :    1;
            uint32_t reserved22                    :    1;
            uint32_t reserved23                    :    1;
            uint32_t reserved24                    :    1;
            uint32_t reserved25                    :    1;
            uint32_t reserved26                    :    1;
            uint32_t reserved27                    :    1;
            uint32_t reserved28                    :    1;
            uint32_t reserved29                    :    1;
            uint32_t reserved30                    :    1;
            uint32_t reserved31                    :    1;
        };
        uint32_t val;
    } int_force_seq_frame_fatal;
    uint32_t reserved_29c;
    union {
        struct {
            uint32_t err_frame_data_vc0     :    1;
            uint32_t err_frame_data_vc1     :    1;
            uint32_t err_frame_data_vc2     :    1;
            uint32_t err_frame_data_vc3     :    1;
            uint32_t err_frame_data_vc4     :    1;
            uint32_t err_frame_data_vc5     :    1;
            uint32_t err_frame_data_vc6     :    1;
            uint32_t err_frame_data_vc7     :    1;
            uint32_t err_frame_data_vc8     :    1;
            uint32_t err_frame_data_vc9     :    1;
            uint32_t err_frame_data_vc10    :    1;
            uint32_t err_frame_data_vc11    :    1;
            uint32_t err_frame_data_vc12    :    1;
            uint32_t err_frame_data_vc13    :    1;
            uint32_t err_frame_data_vc14    :    1;
            uint32_t err_frame_data_vc15    :    1;
            uint32_t reserved16                    :    1;
            uint32_t reserved17                    :    1;
            uint32_t reserved18                    :    1;
            uint32_t reserved19                    :    1;
            uint32_t reserved20                    :    1;
            uint32_t reserved21                    :    1;
            uint32_t reserved22                    :    1;
            uint32_t reserved23                    :    1;
            uint32_t reserved24                    :    1;
            uint32_t reserved25                    :    1;
            uint32_t reserved26                    :    1;
            uint32_t reserved27                    :    1;
            uint32_t reserved28                    :    1;
            uint32_t reserved29                    :    1;
            uint32_t reserved30                    :    1;
            uint32_t reserved31                    :    1;
        };
        uint32_t val;
    } int_st_crc_frame_fatal;
    union {
        struct {
            uint32_t err_frame_data_vc0   :    1;
            uint32_t err_frame_data_vc1   :    1;
            uint32_t err_frame_data_vc2   :    1;
            uint32_t err_frame_data_vc3   :    1;
            uint32_t err_frame_data_vc4   :    1;
            uint32_t err_frame_data_vc5   :    1;
            uint32_t err_frame_data_vc6   :    1;
            uint32_t err_frame_data_vc7   :    1;
            uint32_t err_frame_data_vc8   :    1;
            uint32_t err_frame_data_vc9   :    1;
            uint32_t err_frame_data_vc10  :    1;
            uint32_t err_frame_data_vc11  :    1;
            uint32_t err_frame_data_vc12  :    1;
            uint32_t err_frame_data_vc13  :    1;
            uint32_t err_frame_data_vc14  :    1;
            uint32_t err_frame_data_vc15  :    1;
            uint32_t reserved16                    :    1;
            uint32_t reserved17                    :    1;
            uint32_t reserved18                    :    1;
            uint32_t reserved19                    :    1;
            uint32_t reserved20                    :    1;
            uint32_t reserved21                    :    1;
            uint32_t reserved22                    :    1;
            uint32_t reserved23                    :    1;
            uint32_t reserved24                    :    1;
            uint32_t reserved25                    :    1;
            uint32_t reserved26                    :    1;
            uint32_t reserved27                    :    1;
            uint32_t reserved28                    :    1;
            uint32_t reserved29                    :    1;
            uint32_t reserved30                    :    1;
            uint32_t reserved31                    :    1;
        };
        uint32_t val;
    } int_msk_crc_frame_fatal;
    union {
        struct {
            uint32_t err_frame_data_vc0  :    1;
            uint32_t err_frame_data_vc1  :    1;
            uint32_t err_frame_data_vc2  :    1;
            uint32_t err_frame_data_vc3  :    1;
            uint32_t err_frame_data_vc4  :    1;
            uint32_t err_frame_data_vc5  :    1;
            uint32_t err_frame_data_vc6  :    1;
            uint32_t err_frame_data_vc7  :    1;
            uint32_t err_frame_data_vc8  :    1;
            uint32_t err_frame_data_vc9  :    1;
            uint32_t err_frame_data_vc10 :    1;
            uint32_t err_frame_data_vc11 :    1;
            uint32_t err_frame_data_vc12 :    1;
            uint32_t err_frame_data_vc13 :    1;
            uint32_t err_frame_data_vc14 :    1;
            uint32_t err_frame_data_vc15 :    1;
            uint32_t reserved16                    :    1;
            uint32_t reserved17                    :    1;
            uint32_t reserved18                    :    1;
            uint32_t reserved19                    :    1;
            uint32_t reserved20                    :    1;
            uint32_t reserved21                    :    1;
            uint32_t reserved22                    :    1;
            uint32_t reserved23                    :    1;
            uint32_t reserved24                    :    1;
            uint32_t reserved25                    :    1;
            uint32_t reserved26                    :    1;
            uint32_t reserved27                    :    1;
            uint32_t reserved28                    :    1;
            uint32_t reserved29                    :    1;
            uint32_t reserved30                    :    1;
            uint32_t reserved31                    :    1;
        };
        uint32_t val;
    } int_force_crc_frame_fatal;
    uint32_t reserved_2ac;
    union {
        struct {
            uint32_t err_crc_vc0            :    1;
            uint32_t err_crc_vc1            :    1;
            uint32_t err_crc_vc2            :    1;
            uint32_t err_crc_vc3            :    1;
            uint32_t err_crc_vc4            :    1;
            uint32_t err_crc_vc5            :    1;
            uint32_t err_crc_vc6            :    1;
            uint32_t err_crc_vc7            :    1;
            uint32_t err_crc_vc8            :    1;
            uint32_t err_crc_vc9            :    1;
            uint32_t err_crc_vc10           :    1;
            uint32_t err_crc_vc11           :    1;
            uint32_t err_crc_vc12           :    1;
            uint32_t err_crc_vc13           :    1;
            uint32_t err_crc_vc14           :    1;
            uint32_t err_crc_vc15           :    1;
            uint32_t reserved16                    :    1;
            uint32_t reserved17                    :    1;
            uint32_t reserved18                    :    1;
            uint32_t reserved19                    :    1;
            uint32_t reserved20                    :    1;
            uint32_t reserved21                    :    1;
            uint32_t reserved22                    :    1;
            uint32_t reserved23                    :    1;
            uint32_t reserved24                    :    1;
            uint32_t reserved25                    :    1;
            uint32_t reserved26                    :    1;
            uint32_t reserved27                    :    1;
            uint32_t reserved28                    :    1;
            uint32_t reserved29                    :    1;
            uint32_t reserved30                    :    1;
            uint32_t reserved31                    :    1;
        };
        uint32_t val;
    } int_st_pld_crc_fatal;
    union {
        struct {
            uint32_t err_crc_vc0          :    1;
            uint32_t err_crc_vc1          :    1;
            uint32_t err_crc_vc2          :    1;
            uint32_t err_crc_vc3          :    1;
            uint32_t err_crc_vc4          :    1;
            uint32_t err_crc_vc5          :    1;
            uint32_t err_crc_vc6          :    1;
            uint32_t err_crc_vc7          :    1;
            uint32_t err_crc_vc8          :    1;
            uint32_t err_crc_vc9          :    1;
            uint32_t err_crc_vc10         :    1;
            uint32_t err_crc_vc11         :    1;
            uint32_t err_crc_vc12         :    1;
            uint32_t err_crc_vc13         :    1;
            uint32_t err_crc_vc14         :    1;
            uint32_t err_crc_vc15         :    1;
            uint32_t reserved16                    :    1;
            uint32_t reserved17                    :    1;
            uint32_t reserved18                    :    1;
            uint32_t reserved19                    :    1;
            uint32_t reserved20                    :    1;
            uint32_t reserved21                    :    1;
            uint32_t reserved22                    :    1;
            uint32_t reserved23                    :    1;
            uint32_t reserved24                    :    1;
            uint32_t reserved25                    :    1;
            uint32_t reserved26                    :    1;
            uint32_t reserved27                    :    1;
            uint32_t reserved28                    :    1;
            uint32_t reserved29                    :    1;
            uint32_t reserved30                    :    1;
            uint32_t reserved31                    :    1;
        };
        uint32_t val;
    } int_msk_pld_crc_fatal;
    union {
        struct {
            uint32_t err_crc_vc0         :    1;
            uint32_t err_crc_vc1         :    1;
            uint32_t err_crc_vc2         :    1;
            uint32_t err_crc_vc3         :    1;
            uint32_t err_crc_vc4         :    1;
            uint32_t err_crc_vc5         :    1;
            uint32_t err_crc_vc6         :    1;
            uint32_t err_crc_vc7         :    1;
            uint32_t err_crc_vc8         :    1;
            uint32_t err_crc_vc9         :    1;
            uint32_t err_crc_vc10        :    1;
            uint32_t err_crc_vc11        :    1;
            uint32_t err_crc_vc12        :    1;
            uint32_t err_crc_vc13        :    1;
            uint32_t err_crc_vc14        :    1;
            uint32_t err_crc_vc15        :    1;
            uint32_t reserved16                    :    1;
            uint32_t reserved17                    :    1;
            uint32_t reserved18                    :    1;
            uint32_t reserved19                    :    1;
            uint32_t reserved20                    :    1;
            uint32_t reserved21                    :    1;
            uint32_t reserved22                    :    1;
            uint32_t reserved23                    :    1;
            uint32_t reserved24                    :    1;
            uint32_t reserved25                    :    1;
            uint32_t reserved26                    :    1;
            uint32_t reserved27                    :    1;
            uint32_t reserved28                    :    1;
            uint32_t reserved29                    :    1;
            uint32_t reserved30                    :    1;
            uint32_t reserved31                    :    1;
        };
        uint32_t val;
    } int_force_pld_crc_fatal;
    uint32_t reserved_2bc;
    union {
        struct {
            uint32_t err_id_vc0             :    1;
            uint32_t err_id_vc1             :    1;
            uint32_t err_id_vc2             :    1;
            uint32_t err_id_vc3             :    1;
            uint32_t err_id_vc4             :    1;
            uint32_t err_id_vc5             :    1;
            uint32_t err_id_vc6             :    1;
            uint32_t err_id_vc7             :    1;
            uint32_t err_id_vc8             :    1;
            uint32_t err_id_vc9             :    1;
            uint32_t err_id_vc10            :    1;
            uint32_t err_id_vc11            :    1;
            uint32_t err_id_vc12            :    1;
            uint32_t err_id_vc13            :    1;
            uint32_t err_id_vc14            :    1;
            uint32_t err_id_vc15            :    1;
            uint32_t reserved16                    :    1;
            uint32_t reserved17                    :    1;
            uint32_t reserved18                    :    1;
            uint32_t reserved19                    :    1;
            uint32_t reserved20                    :    1;
            uint32_t reserved21                    :    1;
            uint32_t reserved22                    :    1;
            uint32_t reserved23                    :    1;
            uint32_t reserved24                    :    1;
            uint32_t reserved25                    :    1;
            uint32_t reserved26                    :    1;
            uint32_t reserved27                    :    1;
            uint32_t reserved28                    :    1;
            uint32_t reserved29                    :    1;
            uint32_t reserved30                    :    1;
            uint32_t reserved31                    :    1;
        };
        uint32_t val;
    } int_st_data_id;
    union {
        struct {
            uint32_t err_id_vc0           :    1;
            uint32_t err_id_vc1           :    1;
            uint32_t err_id_vc2           :    1;
            uint32_t err_id_vc3           :    1;
            uint32_t err_id_vc4           :    1;
            uint32_t err_id_vc5           :    1;
            uint32_t err_id_vc6           :    1;
            uint32_t err_id_vc7           :    1;
            uint32_t err_id_vc8           :    1;
            uint32_t err_id_vc9           :    1;
            uint32_t err_id_vc10          :    1;
            uint32_t err_id_vc11          :    1;
            uint32_t err_id_vc12          :    1;
            uint32_t err_id_vc13          :    1;
            uint32_t err_id_vc14          :    1;
            uint32_t err_id_vc15          :    1;
            uint32_t reserved16                    :    1;
            uint32_t reserved17                    :    1;
            uint32_t reserved18                    :    1;
            uint32_t reserved19                    :    1;
            uint32_t reserved20                    :    1;
            uint32_t reserved21                    :    1;
            uint32_t reserved22                    :    1;
            uint32_t reserved23                    :    1;
            uint32_t reserved24                    :    1;
            uint32_t reserved25                    :    1;
            uint32_t reserved26                    :    1;
            uint32_t reserved27                    :    1;
            uint32_t reserved28                    :    1;
            uint32_t reserved29                    :    1;
            uint32_t reserved30                    :    1;
            uint32_t reserved31                    :    1;
        };
        uint32_t val;
    } int_msk_data_id;
    union {
        struct {
            uint32_t err_id_vc0          :    1;
            uint32_t err_id_vc1          :    1;
            uint32_t err_id_vc2          :    1;
            uint32_t err_id_vc3          :    1;
            uint32_t err_id_vc4          :    1;
            uint32_t err_id_vc5          :    1;
            uint32_t err_id_vc6          :    1;
            uint32_t err_id_vc7          :    1;
            uint32_t err_id_vc8          :    1;
            uint32_t err_id_vc9          :    1;
            uint32_t err_id_vc10         :    1;
            uint32_t err_id_vc11         :    1;
            uint32_t err_id_vc12         :    1;
            uint32_t err_id_vc13         :    1;
            uint32_t err_id_vc14         :    1;
            uint32_t err_id_vc15         :    1;
            uint32_t reserved16                    :    1;
            uint32_t reserved17                    :    1;
            uint32_t reserved18                    :    1;
            uint32_t reserved19                    :    1;
            uint32_t reserved20                    :    1;
            uint32_t reserved21                    :    1;
            uint32_t reserved22                    :    1;
            uint32_t reserved23                    :    1;
            uint32_t reserved24                    :    1;
            uint32_t reserved25                    :    1;
            uint32_t reserved26                    :    1;
            uint32_t reserved27                    :    1;
            uint32_t reserved28                    :    1;
            uint32_t reserved29                    :    1;
            uint32_t reserved30                    :    1;
            uint32_t reserved31                    :    1;
        };
        uint32_t val;
    } int_force_data_id;
    uint32_t reserved_2cc;
    union {
        struct {
            uint32_t err_ecc_corrected_vc0  :    1;
            uint32_t err_ecc_corrected_vc1  :    1;
            uint32_t err_ecc_corrected_vc2  :    1;
            uint32_t err_ecc_corrected_vc3  :    1;
            uint32_t err_ecc_corrected_vc4  :    1;
            uint32_t err_ecc_corrected_vc5  :    1;
            uint32_t err_ecc_corrected_vc6  :    1;
            uint32_t err_ecc_corrected_vc7  :    1;
            uint32_t err_ecc_corrected_vc8  :    1;
            uint32_t err_ecc_corrected_vc9  :    1;
            uint32_t err_ecc_corrected_vc10 :    1;
            uint32_t err_ecc_corrected_vc11 :    1;
            uint32_t err_ecc_corrected_vc12 :    1;
            uint32_t err_ecc_corrected_vc13 :    1;
            uint32_t err_ecc_corrected_vc14 :    1;
            uint32_t err_ecc_corrected_vc15 :    1;
            uint32_t reserved16                    :    1;
            uint32_t reserved17                    :    1;
            uint32_t reserved18                    :    1;
            uint32_t reserved19                    :    1;
            uint32_t reserved20                    :    1;
            uint32_t reserved21                    :    1;
            uint32_t reserved22                    :    1;
            uint32_t reserved23                    :    1;
            uint32_t reserved24                    :    1;
            uint32_t reserved25                    :    1;
            uint32_t reserved26                    :    1;
            uint32_t reserved27                    :    1;
            uint32_t reserved28                    :    1;
            uint32_t reserved29                    :    1;
            uint32_t reserved30                    :    1;
            uint32_t reserved31                    :    1;
        };
        uint32_t val;
    } int_st_ecc_corrected;
    union {
        struct {
            uint32_t err_ecc_corrected_vc0:    1;
            uint32_t err_ecc_corrected_vc1:    1;
            uint32_t err_ecc_corrected_vc2:    1;
            uint32_t err_ecc_corrected_vc3:    1;
            uint32_t err_ecc_corrected_vc4:    1;
            uint32_t err_ecc_corrected_vc5:    1;
            uint32_t err_ecc_corrected_vc6:    1;
            uint32_t err_ecc_corrected_vc7:    1;
            uint32_t err_ecc_corrected_vc8:    1;
            uint32_t err_ecc_corrected_vc9:    1;
            uint32_t err_ecc_corrected_vc10:    1;
            uint32_t err_ecc_corrected_vc11:    1;
            uint32_t err_ecc_corrected_vc12:    1;
            uint32_t err_ecc_corrected_vc13:    1;
            uint32_t err_ecc_corrected_vc14:    1;
            uint32_t err_ecc_corrected_vc15:    1;
            uint32_t reserved16                    :    1;
            uint32_t reserved17                    :    1;
            uint32_t reserved18                    :    1;
            uint32_t reserved19                    :    1;
            uint32_t reserved20                    :    1;
            uint32_t reserved21                    :    1;
            uint32_t reserved22                    :    1;
            uint32_t reserved23                    :    1;
            uint32_t reserved24                    :    1;
            uint32_t reserved25                    :    1;
            uint32_t reserved26                    :    1;
            uint32_t reserved27                    :    1;
            uint32_t reserved28                    :    1;
            uint32_t reserved29                    :    1;
            uint32_t reserved30                    :    1;
            uint32_t reserved31                    :    1;
        };
        uint32_t val;
    } int_msk_ecc_corrected;
    union {
        struct {
            uint32_t err_ecc_corrected_vc0:    1;
            uint32_t err_ecc_corrected_vc1:    1;
            uint32_t err_ecc_corrected_vc2:    1;
            uint32_t err_ecc_corrected_vc3:    1;
            uint32_t err_ecc_corrected_vc4:    1;
            uint32_t err_ecc_corrected_vc5:    1;
            uint32_t err_ecc_corrected_vc6:    1;
            uint32_t err_ecc_corrected_vc7:    1;
            uint32_t err_ecc_corrected_vc8:    1;
            uint32_t err_ecc_corrected_vc9:    1;
            uint32_t err_ecc_corrected_vc10:    1;
            uint32_t err_ecc_corrected_vc11:    1;
            uint32_t err_ecc_corrected_vc12:    1;
            uint32_t err_ecc_corrected_vc13:    1;
            uint32_t err_ecc_corrected_vc14:    1;
            uint32_t err_ecc_corrected_vc15:    1;
            uint32_t reserved16                    :    1;
            uint32_t reserved17                    :    1;
            uint32_t reserved18                    :    1;
            uint32_t reserved19                    :    1;
            uint32_t reserved20                    :    1;
            uint32_t reserved21                    :    1;
            uint32_t reserved22                    :    1;
