Lzw655/esp-bsp/examples/p4/base_demo_anti_tearing/esp32_p4_function_ev_board/src/mipi_soc/include/mipi_csi_host_struct.h
            uint32_t reserved23                    :    1;
            uint32_t reserved24                    :    1;
            uint32_t reserved25                    :    1;
            uint32_t reserved26                    :    1;
            uint32_t reserved27                    :    1;
            uint32_t reserved28                    :    1;
            uint32_t reserved29                    :    1;
            uint32_t reserved30                    :    1;
            uint32_t reserved31                    :    1;
        };
        uint32_t val;
    } int_force_ecc_corrected;
    uint32_t reserved_2dc;
    uint32_t reserved_2e0;
    uint32_t reserved_2e4;
    uint32_t reserved_2e8;
    uint32_t reserved_2ec;
    uint32_t reserved_2f0;
    uint32_t reserved_2f4;
    uint32_t reserved_2f8;
    uint32_t reserved_2fc;
    union {
        struct {
            uint32_t scramble_enable           :    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } scrambling;
    union {
        struct {
            uint32_t scramble_seed_lane1       :    16;
            uint32_t reserved16                    :    16;
        };
        uint32_t val;
    } scrambling_seed1;
    union {
        struct {
            uint32_t scramble_seed_lane2       :    16;
            uint32_t reserved16                    :    16;
        };
        uint32_t val;
    } scrambling_seed2;
} mipi_csi_host_dev_t;
extern mipi_csi_host_dev_t MIPI_CSI_HOST;
#ifdef __cplusplus
}
#endif



#endif /*_SOC_MIPI_CSI_HOST_STRUCT_H_ */
